#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/KrisCo/Lab-development/runs/run-E1a4QE2J5vKPvgtY

Waiting for the plan to start...

Terraform v1.1.4
on linux_amd64
Initializing plugins and modules...
aws_vpc.lab: Refreshing state... [id=vpc-00530d07d703d9ec1]
aws_internet_gateway.lab: Refreshing state... [id=igw-0e4bacbc0b0cb4eba]
aws_subnet.lab-public-2: Refreshing state... [id=subnet-0d3391804baad62c3]
aws_subnet.lab-public-1: Refreshing state... [id=subnet-002e9d330eddeb30d]
aws_subnet.lab-public-0: Refreshing state... [id=subnet-0f938a911467c9bd1]
aws_security_group.lab: Refreshing state... [id=sg-027b22860f8854f56]
aws_lb_target_group.lab: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/development-lb-tg/b27826972f8d1151]
aws_route_table.lab: Refreshing state... [id=rtb-0bbb2096df58b721e]
aws_instance.EC2-1: Refreshing state... [id=i-09219e955e64d2a23]
aws_instance.EC2-2: Refreshing state... [id=i-06daec447cbfb6776]
aws_instance.EC2-0: Refreshing state... [id=i-03742a4aac9a26aa6]
aws_route_table_association.public-access-0: Refreshing state... [id=rtbassoc-076271fc7007a2deb]
aws_route_table_association.public-access-2: Refreshing state... [id=rtbassoc-09809330a6e87afe5]
aws_route_table_association.public-access-1: Refreshing state... [id=rtbassoc-0a550610ceb14231a]
aws_lb_target_group_attachment.lab-1: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/development-lb-tg/b27826972f8d1151-20230414151129936400000004]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_instance.EC2-0 has changed
  ~ resource "aws_instance" "EC2-0" {
        id                                   = "i-03742a4aac9a26aa6"
      ~ security_groups                      = [
          - "sg-027b22860f8854f56",
        ]
        tags                                 = {
            "Name" = "EC2-development-0"
        }
        # (32 unchanged attributes hidden)







        # (7 unchanged blocks hidden)
    }

  # aws_instance.EC2-1 has changed
  ~ resource "aws_instance" "EC2-1" {
        id                                   = "i-09219e955e64d2a23"
      ~ security_groups                      = [
          - "sg-027b22860f8854f56",
        ]
        tags                                 = {
            "Name" = "EC2-development-1"
        }
        # (32 unchanged attributes hidden)







        # (7 unchanged blocks hidden)
    }

  # aws_instance.EC2-2 has changed
  ~ resource "aws_instance" "EC2-2" {
        id                                   = "i-06daec447cbfb6776"
      ~ security_groups                      = [
          - "sg-027b22860f8854f56",
        ]
        tags                                 = {
            "Name" = "EC2-development-2"
        }
        # (32 unchanged attributes hidden)







        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.EC2-0 must be replaced
-/+ resource "aws_instance" "EC2-0" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:949471431711:instance/i-03742a4aac9a26aa6" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-03742a4aac9a26aa6" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0f67bb4acf5fb3909" -> (known after apply)
      ~ private_dns                          = "ip-10-0-0-131.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.0.131" -> (known after apply)
      ~ public_dns                           = "ec2-18-204-212-36.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "18.204.212.36" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-027b22860f8854f56",
        ]
        tags                                 = {
            "Name" = "EC2-development-0"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-027b22860f8854f56",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-04911991e660c1b55" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.EC2-1 must be replaced
-/+ resource "aws_instance" "EC2-1" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:949471431711:instance/i-09219e955e64d2a23" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-09219e955e64d2a23" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0d4243158924f11e0" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-188.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.188" -> (known after apply)
      ~ public_dns                           = "ec2-54-92-206-133.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "54.92.206.133" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-027b22860f8854f56",
        ]
        tags                                 = {
            "Name" = "EC2-development-1"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-027b22860f8854f56",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0bf31904d0ee6b495" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.EC2-2 must be replaced
-/+ resource "aws_instance" "EC2-2" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:949471431711:instance/i-06daec447cbfb6776" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1c" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-06daec447cbfb6776" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-05fd9ef779fd64706" -> (known after apply)
      ~ private_dns                          = "ip-10-0-2-223.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.2.223" -> (known after apply)
      ~ public_dns                           = "ec2-54-166-22-246.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "54.166.22.246" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-027b22860f8854f56",
        ]
        tags                                 = {
            "Name" = "EC2-development-2"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-027b22860f8854f56",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0f333e8254b63bed7" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_lb_target_group_attachment.lab-0 will be created
  + resource "aws_lb_target_group_attachment" "lab-0" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/development-lb-tg/b27826972f8d1151"
      + target_id        = (known after apply)
    }

  # aws_lb_target_group_attachment.lab-1 must be replaced
-/+ resource "aws_lb_target_group_attachment" "lab-1" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/development-lb-tg/b27826972f8d1151-20230414151129936400000004" -> (known after apply)
      ~ target_id        = "i-03742a4aac9a26aa6" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_lb_target_group_attachment.lab-2 will be created
  + resource "aws_lb_target_group_attachment" "lab-2" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/development-lb-tg/b27826972f8d1151"
      + target_id        = (known after apply)
    }

Plan: 6 to add, 0 to change, 4 to destroy.


```

</details>

*Pushed by: @krispigeau, Action: `pull_request`*